Exercises/HelloWorldAPP/src/jbiServiceUnits/HelloWorldAPP.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="HelloWorldAPP"
             xmlns:tns="HelloWorldAPP" xmlns:ns="http://j2ee.netbeans.org/wsdl/HelloWorldBPEL/src/HelloWorld" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/HelloWorldBPEL/src/HelloWorld" location="../jbiServiceUnits/HelloWorldBPEL/HelloWorld.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:HelloWorldPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="HelloWorldOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="HelloWorldAPP"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="HelloWorldAPP"/>
            </output>
        </operation>
    </binding>
    <service name="HelloWorldAPPService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/HelloWorldAPPService1/casaPort1"/>
        </port>
    </service>
</definitions>
