Exercises/HelloWorldAPP/test/HelloTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hel="HelloWorldAPP">
  <soapenv:Body>
    <hel:HelloWorldOperation>
      <part1>Pymma</part1>
    </hel:HelloWorldOperation>
  </soapenv:Body>
</soapenv:Envelope>